
#include <locale.h>
#include <stdlib.h> 

void main()

{

	setlocale(LC_ALL, "RUS"); // для переключения русской кодировки
	puts("     /\     /\        |МЯУ|"); // вывод строки
	puts("    /  \   /  \      /     "); // вывод строки
	puts("     @       @      /      "); // вывод строки
	puts("	      ___        /       "); // вывод строки
	puts("     ---\_/---             "); // вывод строки
	puts("       /   \               "); // вывод строки

	

	puts("          *  *             "); // вывод строки
	puts("         **  **            "); // вывод строки
	puts("        ***  ***            "); // вывод строки
	puts("    *****      *****      "); // вывод строки
	puts("*   *              *    *           "); // вывод строки
	puts("  * *  @        @  *	 *           "); // вывод строки
	puts("  ***	    ****     ***           "); // вывод строки
	puts("  ***	     **      ***             "); // вывод строки
	puts(" *  ****************	*           "); // вывод строки
	puts("*                      *           "); // вывод строки


	return 0;

}